SHORT_REGEX = r'^[a-zA-Z\d]{1,16}$'

OTHER_NAMES = {'original': 'url', 'short': 'custom_id'}

EMPTY = 'отсутствует тело запроса'

EMPTY_URL = 'В запросе отсутствуют обязательные поля'

EMPTY_ID = 'Указанный id не найден'

SHORT_URL_EXISTS = 'Короткая ссылка занята. Придумайте другую или воспользуйтесь предложенной.'

CHANGE_SHORT_URL = 'Ссылка: {} - уже занята.'

INVALID_URL = 'Данная ссылка {} - не прошла проверку.'

VALID_SHORT = 'Для короткой ссылки допустимы только цифры 0-9 и буквы "a-Z". Ваша ссылка не соответствует: {}'